<script setup>
import HeaderComp from '../components/HeaderComp.vue';
import FooterComp from '../components/Footer.vue';
</script>
<template>
      <HeaderComp />
      <main class="main">
            <div class="page-title">
                  <h1 class="h1">Goooose - проект, связаный с LoRa сетями</h1>
                  <span class="year">Был создан студентами в лохматом году...</span>
            </div>
            <img class="img" src="../assets/images/goosiRuns.png" alt="Geese are running" align="left" >
            <p class="p">История нашего проекта начинается с группы преданных студентов, которые разделяли общую
                  страсть к новейшим технологиям и убеждение в их потенциале изменить мир. Одним из таких
                  потенциально преобразующих технологий была LoRa (Long Range) - передовая технология беспроводной
                  связи, специально разработанная для Интернета Вещей (IoT).</p>
                  <br>
            <p class="p">Наша команда начала изучать и экспериментировать с LoRa, осознавая его огромный потенциал
                  для улучшения жизни людей и оптимизации различных отраслей. Мы осознали, что LoRa может
                  обеспечить дальнюю связь, низкое энергопотребление и высокую пропускную способность, что делает
                  его идеальным вариантом для масштабирования сетей Интернета Вещей.</p>
                  <br>
            <p class="p">После долгих часов работы, исследований и прототипирования мы создали собственные
                  устройства LoRa и разработали гибкую и надежную инфраструктуру для создания сетей на основе этой
                  технологии. Наша команда изучила все аспекты производства устройств LoRa, начиная от
                  проектирования и разработки электроники до сборки и тестирования устройств. Мы стремились к
                  высочайшему качеству и инновационным решениям, чтобы наши устройства стали стандартом надежности
                  и эффективности в области IoT.</p>
                  <br>
            <p class="p">С каждым успешным проектом и довольными клиентами наша страсть к LoRa искала все новые
                  выражения. Мы начали продвигать наши устройства и сети LoRa в свет, организуя мероприятия для
                  представления технологии широкой аудитории. Мы проводили семинары, выставки и конференции, чтобы
                  поделиться нашими знаниями и опытом с другими людьми, заинтересованными в IoT и потенциале LoRa.</p>
                  <br>
            <p class="p">Сегодня наш проект по продаже сетей LoRa и производству устройств LoRa стал востребованным и
                  успешным. Мы продолжаем инновационную работу, разрабатываем новые продукты и расширяем нашу клиентскую
                  базу. Нашей главной целью всегда было и остается продвижение новейших технологий в свет и создание
                  связи между людьми и возможностями, которые они предлагают.</p>
            <br>

            <p class="p">Проект студентов, который начинался с идеи и страсти, сегодня стал ключевым игроком в сфере
                  LoRa сетей и устройств. Мы гордимся тем, что наш вклад вносит положительные изменения в мир и
                  вдохновляет других на использование новых технологий для достижения своих целей.</p>
      </main>
      <FooterComp />
</template>
<style scoped>
.main {
      padding-left: 10%;
      padding-right: 10%;
      padding-bottom: 8%;

      text-align: justify;
}

.page-title{
      margin-bottom: 2rem;
}

.h1{
      margin-bottom: 0;
      line-height: 1;
}

.year{
      font-weight: 500;
      color: var(--color-accent);
}

.img {
      margin: 2rem 3rem;
      min-width: 280px;
      min-height: 280px;
      width: 24%;
      height: 24%;

      border-radius: 100%;
}


@media (max-width: 1199px) {
      .main {
            padding-left: 40px;
            padding-right: 40px;
      }

}

@media (max-width: 991px) {
      .main {
            padding-left: 24px;
            padding-right: 24px;
      } 
      .img{
            margin: 1.5rem 2rem;
      } 
}

@media (max-width: 575px) {
      .main {
            padding-left: 12px;
            padding-right: 12px;
      } 
      .page-title{
            margin-bottom: 1rem;
      }
      .img{
            margin: 1.5rem calc((100% - 280px)/2);
      } 
}

</style>